In [7]:
import sqlalchemy as db
from sqlalchemy import text
import pandas as pd

In [3]:
engine = db.create_engine("mysql://root:root@172.16.5.4:3310/retail_db")

In [5]:
conn= engine.connect()

In [8]:
customer_df = pd.read_sql("SELECT * FROM customers", con= conn)
customer_df.head()

,customer_id,customer_fname,customer_lname,customer_email,customer_password,customer_street,customer_city,customer_state,customer_zipcode
0,1,Richard,Hernandez,XXXXXXXXX,XXXXXXXXX,6303 Heather Plaza,Brownsville,TX,78521
1,2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126
2,3,Ann,Smith,XXXXXXXXX,XXXXXXXXX,3422 Blue Pioneer Bend,Caguas,PR,00725
3,4,Mary,Jones,XXXXXXXXX,XXXXXXXXX,8324 Little Common,San Marcos,CA,92069
4,5,Robert,Hudson,XXXXXXXXX,XXXXXXXXX,10 Crystal River Mall,Caguas,PR,00725

In [9]:
order_df = pd.read_sql("SELECT * FROM orders", con= conn)
order_df.head()

   order_id order_date  order_customer_id     order_status
0         1 2013-07-25              11599           CLOSED
1         2 2013-07-25                256  PENDING_PAYMENT
2         3 2013-07-25              12111         COMPLETE
3         4 2013-07-25               8827           CLOSED
4         5 2013-07-25              11318         COMPLETE

In [10]:
order_items_df = pd.read_sql("SELECT * FROM order_items", con= conn)
order_items_df.head()

,order_item_id,order_item_order_id,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_product_price
0,1,1,957,1,299.98,299.98
1,2,2,1073,1,199.99,199.99
2,3,2,502,5,250.00,50.00
3,4,2,403,1,129.99,129.99
4,5,4,897,2,49.98,24.99

In [12]:
departments_df = pd.read_sql("SELECT * FROM departments", con= conn)
departments_df.head()

   department_id department_name
0              2         Fitness
1              3        Footwear
2              4         Apparel
3              5            Golf
4              6        Outdoors

In [13]:
products_df = pd.read_sql("SELECT * FROM products", con= conn)
products_df.head()

,product_id,product_category_id,product_name,product_description,product_price,product_image
0,1,2,Quest Q64 10 FT. x 10 FT. Slant Leg Instant U,,59.98,http://images.acmesports.sports/Quest+Q64+10+F...
1,2,2,Under Armour Men's Highlight MC Football Clea,,129.99,http://images.acmesports.sports/Under+Armour+M...
2,3,2,Under Armour Men's Renegade D Mid Football Cl,,89.99,http://images.acmesports.sports/Under+Armour+M...
3,4,2,Under Armour Men's Renegade D Mid Football Cl,,89.99,http://images.acmesports.sports/Under+Armour+M...
4,5,2,Riddell Youth Revolution Speed Custom Footbal,,199.99,http://images.acmesports.sports/Riddell+Youth+...

In [14]:
categories_df = pd.read_sql("SELECT * FROM categories", con= conn)
categories_df.head()

   category_id  category_department_id        category_name
0            1                       2             Football
1            2                       2               Soccer
2            3                       2  Baseball & Softball
3            4                       2           Basketball
4            5                       2             Lacrosse

In [15]:
#Promedio ingresos por dia

df_promedio = order_df.merge(order_items_df, left_on='order_id', right_on='order_item_order_id', how='left')
df_promedio.head()

,order_id,order_date,order_customer_id,order_status,order_item_id,order_item_order_id,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_product_price
0,1,2013-07-25,11599,CLOSED,1.0,1.0,957.0,1.0,299.98,299.98
1,2,2013-07-25,256,PENDING_PAYMENT,2.0,2.0,1073.0,1.0,199.99,199.99
2,2,2013-07-25,256,PENDING_PAYMENT,3.0,2.0,502.0,5.0,250.00,50.00
3,2,2013-07-25,256,PENDING_PAYMENT,4.0,2.0,403.0,1.0,129.99,129.99
4,3,2013-07-25,12111,COMPLETE,NaN,NaN,NaN,NaN,NaN,NaN

In [19]:
df_promedio_final = df_promedio[['order_date','order_item_subtotal']].groupby('order_date').sum()['order_item_subtotal']/df_promedio[['order_date','order_item_subtotal']].drop_duplicates().groupby('order_date').count()['order_item_subtotal']
df_promedio_final

order_date
2013-07-25    1419.871458
2013-07-26    1772.989221
2013-07-27    1630.231290
2013-07-28    1613.390370
2013-07-29    1880.645068
                 ...
2014-07-20    2080.879412
2014-07-21    1953.270484
2014-07-22    1492.537959
2014-07-23    1660.195849
2014-07-24    1493.482154
Name: order_item_subtotal, Length: 364, dtype: float64

In [26]:
df_promedio_final = df_promedio[['order_date','order_item_subtotal']].groupby('order_date').sum()['order_item_subtotal']/df_promedio[['order_date','order_item_subtotal']].drop_duplicates().groupby('order_date').count()['order_item_subtotal']


df_promedio_final

order_date
2013-07-25    1419.871458
2013-07-26    1772.989221
2013-07-27    1630.231290
2013-07-28    1613.390370
2013-07-29    1880.645068
                 ...
2014-07-20    2080.879412
2014-07-21    1953.270484
2014-07-22    1492.537959
2014-07-23    1660.195849
2014-07-24    1493.482154
Name: order_item_subtotal, Length: 364, dtype: float64

In [27]:
# Ingreso promedio por mes
df_promedio['month']=df_promedio['order_date'].astype(str).str[5:7]
df_promedio['month']= df_promedio['month'].astype('int32')
df_promedio.head()

,order_id,order_date,order_customer_id,order_status,order_item_id,order_item_order_id,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_product_price,month
0,1,2013-07-25,11599,CLOSED,1.0,1.0,957.0,1.0,299.98,299.98,7
1,2,2013-07-25,256,PENDING_PAYMENT,2.0,2.0,1073.0,1.0,199.99,199.99,7
2,2,2013-07-25,256,PENDING_PAYMENT,3.0,2.0,502.0,5.0,250.00,50.00,7
3,2,2013-07-25,256,PENDING_PAYMENT,4.0,2.0,403.0,1.0,129.99,129.99,7
4,3,2013-07-25,12111,COMPLETE,NaN,NaN,NaN,NaN,NaN,NaN,7

In [30]:
df_promedio_final_mes = df_promedio[['month','order_item_subtotal']].groupby('month').sum()['order_item_subtotal']/df_promedio[['month','order_item_subtotal']].drop_duplicates().groupby('month').count()['order_item_subtotal']

df_promedio_final_mes

month
1     17407.422679
2     16738.937711
3     17243.928976
4     17016.907879
5     16387.370357
6     15717.810698
7     17460.922733
8     17247.918902
9     17364.066686
10    16003.662256
11    19088.289337
12    17458.120655
Name: order_item_subtotal, dtype: float64

In [32]:
#deptos con mejores rendimientos
df_join  = order_df.merge(order_items_df, left_on='order_id', right_on='order_item_order_id')\
                    .merge(products_df, left_on='order_item_product_id', right_on='product_id')\
                    .merge(categories_df, left_on='product_category_id', right_on='category_id')\
                    .merge(departments_df, left_on='category_department_id', right_on='department_id')

In [34]:
df_promedio = df_join[['department_name','order_item_subtotal']].groupby('department_name').sum()['order_item_subtotal']/df_join[['department_name','order_item_order_id']]\
                    .drop_duplicates().groupby('department_name').count()['order_item_order_id']

df_promedio

department_name
Apparel     222.004311
Fan Shop    419.575364
Fitness     134.636606
Footwear    307.978997
Golf        178.030369
Outdoors    116.008241
dtype: float64